# ETL Processes
Use this notebook to develop the ETL process for each of your tables before completing the `etl.py` file to load the whole datasets.

In [1]:
import os
import glob
import psycopg2
import pandas as pd
from sql_queries import *
%run create_tables.py

In [2]:
conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
cur = conn.cursor()

In [3]:
def get_files(filepath):
    all_files = []
    for root, dirs, files in os.walk(filepath):
        files = glob.glob(os.path.join(root,'*.json'))
        for f in files :
            all_files.append(os.path.abspath(f))
    
    return all_files

# Process `song_data`
In this first part, you'll perform ETL on the first dataset, `song_data`, to create the `songs` and `artists` dimensional tables.

Let's perform ETL on a single song file and load a single record into each table to start.
- Use the `get_files` function provided above to get a list of all song JSON files in `data/song_data`
- Select the first song in this list
- Read the song file and view the data

In [4]:
song_files = get_files(r'data/song_data')

song_files[0]

'/home/workspace/data/song_data/A/A/A/TRAAAAW128F429D538.json'

In [5]:
df = pd.read_json(song_files[0], lines=True)

i = 0

while i < len(song_files):
    df_add = pd.read_json(song_files[i], lines=True)
    df = pd.concat([df, df_add])
    i += 1

df.drop_duplicates(subset= df.columns[:].tolist(), inplace=True)

display(df.head(1))
display(df.info())

,artist_id,artist_latitude,artist_location,artist_longitude,artist_name,duration,num_songs,song_id,title,year
0,ARD7TVE1187B99BFB1,NaN,California - LA,NaN,Casual,218.93179,1,SOMZWCG12A8C13C480,I Didn't Mean To,0

<class 'pandas.core.frame.DataFrame'>
Int64Index: 71 entries, 0 to 0
Data columns (total 10 columns):
artist_id           71 non-null object
artist_latitude     31 non-null float64
artist_location     71 non-null object
artist_longitude    31 non-null float64
artist_name         71 non-null object
duration            71 non-null float64
num_songs           71 non-null int64
song_id             71 non-null object
title               71 non-null object
year                71 non-null int64
dtypes: float64(3), int64(2), object(5)
memory usage: 6.1+ KB

None

## #1: `songs` Table
#### Extract Data for Songs Table
- Select columns for song ID, title, artist ID, year, and duration
- Use `df.values` to select just the values from the dataframe
- Index to select the first (only) record in the dataframe
- Convert the array to a list and set it to `song_data`

In [6]:
songs = df[['song_id', 'title', 'artist_id', 'year', 'duration']]

song_data = songs.values.tolist()
print('\nColumn Names for song_data:\n')
display(songs.columns.tolist())
print('\nFirst Record of song_data:\n')
display(song_data[0])

Column Names for song_data:

['song_id', 'title', 'artist_id', 'year', 'duration']

First Record of song_data:

['SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, 218.93179]

#### Insert Record into Song Table
Implement the `song_table_insert` query in `sql_queries.py` and run the cell below to insert a record for this song into the `songs` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `songs` table in the sparkify database.

In [7]:
# Load each record from df
row = 0

while row < len(song_data):
    cur.execute(song_table_insert, song_data[row])
    conn.commit()
    row += 1

Run `test.ipynb` to see if you've successfully added a record to this table.

## #2: `artists` Table
#### Extract Data for Artists Table
- Select columns for artist ID, name, location, latitude, and longitude
- Use `df.values` to select just the values from the dataframe
- Index to select the first (only) record in the dataframe
- Convert the array to a list and set it to `artist_data`

In [8]:
artists = df[['artist_id', 'artist_name', 'artist_location', 'artist_latitude', 'artist_longitude']]

artist_data = artists.values.tolist()

#### Insert Record into Artist Table
Implement the `artist_table_insert` query in `sql_queries.py` and run the cell below to insert a record for this song's artist into the `artists` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `artists` table in the sparkify database.

In [9]:
# Load each record from df
row = 0

while row < len(artist_data):
    cur.execute(artist_table_insert, artist_data[row])
    conn.commit()
    row += 1

Run `test.ipynb` to see if you've successfully added a record to this table.

# Process `log_data`
In this part, you'll perform ETL on the second dataset, `log_data`, to create the `time` and `users` dimensional tables, as well as the `songplays` fact table.

Let's perform ETL on a single log file and load a single record into each table.
- Use the `get_files` function provided above to get a list of all log JSON files in `data/log_data`
- Select the first log file in this list
- Read the log file and view the data

In [10]:
log_files = get_files(r'data/log_data')

df = pd.read_json(log_files[0], lines=True)

In [11]:
i = 0

while i < len(log_files):
    df_add = pd.read_json(log_files[i], lines=True)
    df = pd.concat([df, df_add])
    i += 1

df.drop_duplicates(subset= df.columns[:].tolist(), inplace=True)

display(df.head(1))
display(df.info())

,artist,auth,firstName,gender,itemInSession,lastName,length,level,location,method,page,registration,sessionId,song,status,ts,userAgent,userId
0,Stephen Lynch,Logged In,Jayden,M,0,Bell,182.85669,free,"Dallas-Fort Worth-Arlington, TX",PUT,NextSong,1.540992e+12,829,Jim Henson's Dead,200,1543537327796,Mozilla/5.0 (compatible; MSIE 10.0; Windows NT...,91

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8056 entries, 0 to 145
Data columns (total 18 columns):
artist           6820 non-null object
auth             8056 non-null object
firstName        7770 non-null object
gender           7770 non-null object
itemInSession    8056 non-null int64
lastName         7770 non-null object
length           6820 non-null float64
level            8056 non-null object
location         7770 non-null object
method           8056 non-null object
page             8056 non-null object
registration     7770 non-null float64
sessionId        8056 non-null int64
song             6820 non-null object
status           8056 non-null int64
ts               8056 non-null int64
userAgent        7770 non-null object
userId           8056 non-null object
dtypes: float64(2), int64(4), object(12)
memory usage: 1.2+ MB

None

## #3: `time` Table
#### Extract Data for Time Table
- Filter records by `NextSong` action
- Convert the `ts` timestamp column to datetime
  - Hint: the current timestamp is in milliseconds
- Extract the timestamp, hour, day, week of year, month, year, and weekday from the `ts` column and set `time_data` to a list containing these values in order
  - Hint: use pandas' [`dt` attribute](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.html) to access easily datetimelike properties.
- Specify labels for these columns and set to `column_labels`
- Create a dataframe, `time_df,` containing the time data for this file by combining `column_labels` and `time_data` into a dictionary and converting this into a dataframe

In [12]:
import datetime as dt

#filter to nextsong per instructions
dfc = df.copy() 
dfc = dfc[dfc['page'] == 'NextSong']

# Transform ts field into fields for time table
dfc['ts'] =  pd.to_datetime(dfc['ts'], infer_datetime_format=True)
dfc['start_time'] = pd.to_datetime(dfc['ts'], format="%Y-%m-%d %H:%M:%S.%f")
dfc['hour'] = dfc['start_time'].dt.hour
dfc['day'] = dfc['start_time'].dt.day
dfc['week'] = dfc['start_time'].dt.week
dfc['month'] = dfc['start_time'].dt.month
dfc['year'] = dfc['start_time'].dt.year
dfc['weekday'] = dfc['start_time'].dt.day_name()

# Create time table
time_df = dfc[['start_time','hour','day','week','month','year','weekday']]
time_df.head(1)

                     start_time  hour  day  week  month  year   weekday
0 1970-01-01 00:25:43.537327796     0    1     1      1  1970  Thursday

#### Insert Records into Time Table
Implement the `time_table_insert` query in `sql_queries.py` and run the cell below to insert records for the timestamps in this log file into the `time` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `time` table in the sparkify database.

In [13]:
for i, row in time_df.iterrows():
    cur.execute(time_table_insert, list(row))
    conn.commit()

Run `test.ipynb` to see if you've successfully added records to this table.

## #4: `users` Table
#### Extract Data for Users Table
- Select columns for user ID, first name, last name, gender and level and set to `user_df`

In [14]:
user_df = dfc[['userId','firstName','lastName','gender','level']]
user_df.rename(columns={'userId':'user_id','firstName':'first_name', 'lastName':'last_name'}, inplace=True)
user_df.head(1)

/opt/conda/lib/python3.6/site-packages/pandas/core/frame.py:3781: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  return super(DataFrame, self).rename(**kwargs)

  user_id first_name last_name gender level
0      91     Jayden      Bell      M  free

#### Insert Records into Users Table
Implement the `user_table_insert` query in `sql_queries.py` and run the cell below to insert records for the users in this log file into the `users` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `users` table in the sparkify database.

In [15]:
for i, row in user_df.iterrows():
    cur.execute(user_table_insert, row)
    conn.commit()

Run `test.ipynb` to see if you've successfully added records to this table.

## #5: `songplays` Table
#### Extract Data and Songplays Table
This one is a little more complicated since information from the songs table, artists table, and original log file are all needed for the `songplays` table. Since the log file does not specify an ID for either the song or the artist, you'll need to get the song ID and artist ID by querying the songs and artists tables to find matches based on song title, artist name, and song duration time.
- Implement the `song_select` query in `sql_queries.py` to find the song ID and artist ID based on the title, artist name, and duration of a song.
- Select the timestamp, user ID, level, song ID, artist ID, session ID, location, and user agent and set to `songplay_data`

#### Insert Records into Songplays Table
- Implement the `songplay_table_insert` query and run the cell below to insert records for the songplay actions in this log file into the `songplays` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `songplays` table in the sparkify database.

In [16]:
# for index, row in dfc.iterrows():

#     # get songid and artistid from song and artist tables
#     cur.execute(song_select, (row.song, row.artist, row.length))
#     results = cur.fetchone()
    
#     if results:
#         song_id, artist_id = results
#     else:
#         song_id, artist_id = None, None

#     # insert songplay record
#     songplay_data = (row.start_time, row.userId, row.level, song_id, artist_id, row.sessionId, row.location, row.userAgent)
#     cur.execute(songplay_table_insert, songplay_data)
#     conn.commit()

In [18]:
dfc.rename(columns={'userId':'user_id','firstName':'first_name','lastName':'last_name','sessionId' : 'session_id','userAgent':'user_agent','song':'title','artist':'name','length':'duration'}, inplace=True)

from sqlalchemy import create_engine

engine = create_engine("postgresql+psycopg2://student:student@127.0.0.1/sparkifydb")

query = """
select distinct s.song_id
     , s.artist_id
     , s.title
     , a.name
     , s.duration
from songs s
join artists a on a.artist_id = s.artist_id
"""

query_df = pd.read_sql_query(query,con=engine)
query_df.head()

test_df = pd.merge(dfc,query_df,on=['title','name','duration'],how='left')
test_df = test_df[['start_time', 'user_id', 'level', 'song_id', 'artist_id', 'session_id', 'location', 'user_agent']]
display(test_df[test_df['song_id'].notnull()])
display(test_df.info())

,start_time,user_id,level,song_id,artist_id,session_id,location,user_agent
4107,1970-01-01 00:25:42.837407796,15,paid,SOZCTXZ12AB0182364,AR5KOSW1187FB35FF4,818,"Chicago-Naperville-Elgin, IL-IN-WI","""Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/5..."

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6820 entries, 0 to 6819
Data columns (total 8 columns):
start_time    6820 non-null datetime64[ns]
user_id       6820 non-null object
level         6820 non-null object
song_id       1 non-null object
artist_id     1 non-null object
session_id    6820 non-null int64
location      6820 non-null object
user_agent    6820 non-null object
dtypes: datetime64[ns](1), int64(1), object(6)
memory usage: 479.5+ KB

None

In [21]:
c = test_df.copy()
import numpy as np

c = c.astype(object).where(pd.notnull(c), None)

c.head()

,start_time,user_id,level,song_id,artist_id,session_id,location,user_agent
0,1970-01-01 00:25:43.537327796,91,free,None,None,829,"Dallas-Fort Worth-Arlington, TX",Mozilla/5.0 (compatible; MSIE 10.0; Windows NT...
1,1970-01-01 00:25:43.540121796,73,paid,None,None,1049,"Tampa-St. Petersburg-Clearwater, FL","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."
2,1970-01-01 00:25:43.540368796,73,paid,None,None,1049,"Tampa-St. Petersburg-Clearwater, FL","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."
3,1970-01-01 00:25:43.540625796,73,paid,None,None,1049,"Tampa-St. Petersburg-Clearwater, FL","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."
4,1970-01-01 00:25:43.540856796,73,paid,None,None,1049,"Tampa-St. Petersburg-Clearwater, FL","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."

Run `test.ipynb` to see if you've successfully added records to this table.

# Close Connection to Sparkify Database

In [17]:
conn.close()

# Implement `etl.py`
Use what you've completed in this notebook to implement `etl.py`.